class Urls:
    BASE_URL = 'https://qa-scooter.praktikum-services.ru/'
    ORDER_URL = f'{BASE_URL}order'
    DZEN_URL = 'https://dzen.ru/'


class AccordionData:
    ANSWERS = {
        0: 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.',
        1: 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.',
        2: 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.',
        3: 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.',
        4: 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.',
        5: 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.',
        6: 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.',
        7: 'Да, обязательно. Всем самокатов! И Москве, и Московской области.',
    }


class OrderData:
    ORDER_DATA_SET_1 = {
        'first_name': 'Александр',
        'last_name': 'Александров',
        'address': 'ул. Кастанаевская, д. 1, кв 1',
        'subway_station': 'Багратионовская',
        'phone': '89998887766',
        'date': '15.10.2026',
        'rental_period': 'сутки',
        'color': 'black',
        'comment': 'Позвонить за 12 минут',
    }

    ORDER_DATA_SET_2 = {
        'first_name': 'Анна',
        'last_name': 'Аннова',
        'address': 'ул. Сеславинская, д. 22, кв 13',
        'subway_station': 'Филёвский парк',
        'phone': '89995554433',
        'date': '22.10.2026',
        'rental_period': 'двое суток',
        'color': 'grey',
        'comment': 'Оставить у подъезда',
    }
